_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_MSP_НастройкаСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранитьНастройкиВEXCEL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьEXCEL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоНаименованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоДополнительнымРеквизитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаMSPНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСтатусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_MSP_СтатусыВыгрузкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененПослеВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации/Forms/ФормаВыгрузки/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаИндикатор;

&НаКлиенте
Перем ПараметрыОбработчика;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор=Новый Структура;
	Отбор.Вставить("ТолькоНеСопоставленныеВПроекте",Ложь);
	Отбор.Вставить("ТолькоНеСопоставленныеВСмете",Ложь);
	Отбор.Вставить("ПоказыватьВСмете",-1);
	Отбор.Вставить("ПоказыватьВПроекте",-1);

	Набор=Справочники.НаборыДополнительныхРеквизитовИСведений["Документ_СМ_ПозицияЛокальнойСметы"];
	Ном=1;
	Для Каждого Рекв Из Набор.ДополнительныеРеквизиты Цикл
		ИмяКолонки="Колонка"+СтрЗаменить(Ном,Символы.НПП,"");
		ЗаголовокКолонки=Рекв.Свойство.Заголовок;
		Стр=СоответствиеКолонокДопРеквизитов.Добавить();
		Стр.ИмяКолонки=ИмяКолонки;
		Стр.Заголовок=ЗаголовокКолонки;
		Стр.Свойство=Рекв.Свойство;
		Стр.ЮИД=Рекв.Свойство.УникальныйИдентификатор();
		Ном=Ном+1;
	КонецЦикла;

	ЗаполнитьНастройки();
	
	Если Параметры.Свойство("Смета") Тогда 
		Смета.Добавить(Параметры.Смета); 
		ОбъектСтроительства=Параметры.Смета.Стройка;
	ИначеЕсли Параметры.Свойство("ОбъектСтроительства") Тогда	
		ОбъектСтроительства=Параметры.ОбъектСтроительства;
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "
		|ВЫБРАТЬ
		|	СМ_ЛокальнаяСмета.Ссылка
		|ИЗ
		|	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
		|ГДЕ
		|	СМ_ЛокальнаяСмета.Стройка = &Стройка И
		|	( СМ_ЛокальнаяСмета.Статус В(&Статус) ИЛИ &БезСтатусов) И НЕ
		|	СМ_ЛокальнаяСмета.ПометкаУдаления";
		 Запрос.УстановитьПараметр("Стройка",ОбъектСтроительства);
		 Запрос.УстановитьПараметр("БезСтатусов",Не ПолучитьФункциональнуюОпцию("СМ_ИспользоватьСтатусыДокументов"));
		 Запрос.УстановитьПараметр("Статус",ОБъект.РазрешенныеСтатусы.Выгрузить(,"Статус"));
		 Рез=запрос.Выполнить().Выгрузить();
		 Смета.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
	
	Если Объект.СинхронизироватьПоДополнительнымРеквизитам Тогда
		НовыеКолонки = Новый Массив; 
		НовыеКолонкиСоответствия=новый Массив;
		НовыеКолонкиДерева = Новый Массив; 

		Для Каждого Рекв Из СоответствиеКолонокДопРеквизитов Цикл
			
			Если Рекв.Используется Тогда
				НовыеКолонки.Добавить(Новый РеквизитФормы(Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ЗадачиПроекта",Рекв.Заголовок)); 
				НовыеКолонкиДерева.Добавить(Новый РеквизитФормы("Д"+Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ДеревоСмет",Рекв.Заголовок)); 
				НовыеКолонкиСоответствия.Добавить(Новый РеквизитФормы("П"+Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ТаблицаСопоставлений",Рекв.Заголовок)); 
				НовыеКолонкиСоответствия.Добавить(Новый РеквизитФормы("С"+Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ТаблицаСопоставлений",Рекв.Заголовок)); 
			Конецесли;
		КонецЦикла;
		
		ИзменитьРеквизиты(НовыеКолонки);
		ИзменитьРеквизиты(НовыеКолонкиДерева);
		ИзменитьРеквизиты(НовыеКолонкиСоответствия);
		
		Для каждого Колонка Из НовыеКолонки Цикл 
			НовыйЭлемент = Элементы.Добавить("ЗадачиПроекта"+Колонка.Имя,Тип("ПолеФормы"),Элементы.ЗадачиПроекта); 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			НовыйЭлемент.ПутьКДанным = "ЗадачиПроекта."+Колонка.Имя; 
			НовыйЭлемент.ТолькоПросмотр = Истина; 
		КонецЦикла; 
		
		Для каждого Колонка Из НовыеКолонкиДерева Цикл 
			НовыйЭлемент = Элементы.Добавить("ДеревоСмет"+Колонка.Имя,Тип("ПолеФормы"),Элементы.ДеревоСмет); 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			НовыйЭлемент.ПутьКДанным = "ДеревоСмет."+Колонка.Имя; 
			НовыйЭлемент.ТолькоПросмотр = Истина; 
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаВводПутиКФайлу",Новый Структура("ОбъектСтроительства,Сметы",ОБъектСтроительства,Смета),,,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("ПослеВыбораФайлаПроекта", ЭтотОбъект, ),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКРезервномуФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ФильтрДляДиалога 	= "MS Project|*.mpp";
	ФильтрДляДиалога 	= ФильтрДляДиалога + "|Все файлы (*.*)|*.*";
	Диалог.Фильтр 		= ФильтрДляДиалога;
	
	// Синхронный вызов
	//Если Диалог.Выбрать() Тогда
	//	ПутьКРезервномуФайлу = Диалог.ПолноеИмяФайла;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	Диалог.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ПутьКРезервномуФайлу = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиПроекта

&НаКлиенте
Процедура ЗадачиПроектаДействиеПриИзменении(Элемент)
	
	Если Элементы.ЗадачиПроекта.ТекущаяСтрока<>Неопределено  Тогда
		МассивПроект=Новый Массив;
		Для Каждого Эл Из   Элементы.ЗадачиПроекта.ВыделенныеСтроки Цикл
			МассивПроект.Добавить(Эл);
		КонецЦикла;
		ИзменитьОбъемНаСервере(МассивПроект);
	Конецесли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСмет

&НаКлиенте
Процедура ДеревоСметВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ДеревоСмет.ТекущиеДанные<>Неопределено Тогда
		СтандартнаяОбработка=Ложь;
		ТекСтр=Элементы.ДеревоСмет.ТекущиеДанные.Ссылка;
		Если ТипЗнч(ТекСтр)=Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда 
			ОткрытьФорму("Документ.СМ_ЛокальнаяСмета.Форма.ФормаДокументаУпр",Новый Структура("Ключ",ТекСтр));
		ИначеЕсли ТипЗнч(ТекСтр)=Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда 
			ОткрытьФорму("Документ.СМ_ПозицияЛокальнойСметы.Форма.ФормаДокументаУпр",Новый Структура("Ключ",ТекСтр));
		ИначеЕсли ТипЗнч(ТекСтр)=Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда 
			ОткрытьФорму("Документ.СМ_РазделЛокальнойСметы.Форма.ФормаДокументаУпр",Новый Структура("Ключ",ТекСтр));
		КонецЕсли;
	КонецЕсли;
  
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСметПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя ="ДеревоСметКомментарий" Тогда
		Если Элементы.ДеревоСмет.ТекущиеДанные<>Неопределено Тогда
			Если Элементы.ДеревоСмет.ТекущиеДанные.КомментСсылка="Открыть" Тогда
				ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаКомментарий",Новый Структура("Комментарий",ПолучитьТекстКомментария(Элементы.ДеревоСмет.ТекущаяСтрока)),ЭтаФорма,,ВариантОткрытияокна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.Независимый);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьвMSP(Команда)
	
	ДвоичныеДанныеФайла=Неопределено;
	МассивЗначений=Новый Массив;
	Позиции=Новый Массив;
	
	Если НЕ ВыгрузитьВMSPНаСервере(ДвоичныеДанныеФайла,МассивЗначений,Позиции) Тогда
		Если СМ_MSP_Клиент.ЗаписатьФайлОбъекта(ОбъектСтроительства,МассивЗначений) Тогда
			ЗаписатьСтатусыПозицийНаСервере(Позиции);
			Попытка
			СформироватьОтчет(МассивЗначений).Показать();
		Исключение
			КонецПопытки;

		КонецЕсли;
	КонецЕсли;
	
	Если ДвоичныеДанныеФайла<>Неопределено Тогда
		ДвоичныеДанныеФайла.Записать(ПутьКРезервномуФайлу);
	Конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("ЗадачиПроекта",ЗадачиПроекта);
	ПараметрыФормы.Вставить("ДеревоСмет",ДеревоСмет);

	ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаОтчеты",ПараметрыФормы,ЭтаФорма);
	
	//Для Каждого Эл Из СформироватьОтчет() Цикл
	//	Эл.ТД.Показать(Эл.Заголовок);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НеСопоставленныеВПроекте(Команда)
	Отбор.ТолькоНеСопоставленныеВПроекте=Истина;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура НеСопоставленныеВСмете(Команда)
	Отбор.ТолькоНеСопоставленныеВСмете=Истина;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСметы(Команда)
	
	ФоновоеЗадание = Ложь;
	Если НЕ ФормаИндикатор.Открыта() Тогда
		ФормаИндикатор=ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаИндикатор",Новый Структура("Текст","Загрузка данных проекта из MS Project"),ЭтаФорма,,ВариантОткрытияокна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
	ФормаИндикатор.Элементы.Прогресс.МаксимальноеЗначение=100;
	ФормаИндикатор.Прогресс=5;
	ФормаИндикатор.Элементы.Текст.Заголовок="Обновление данных сопоставления";
	ФормаИндикатор.ОбновитьОтображениеДанных();
	ЗаполнитьСерверВФоне(Неопределено,ФоновоеЗадание);
	Если ФоновоеЗадание Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", 1, Истина);
		ПараметрыОбработчика.МаксимальныйИнтервал = 5;
	Иначе
		ФормаИндикатор.Закрыть();
	КонецЕсли;

	//ЗаполнитьСервер(Неопределено,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВПроекте(Команда)
	
	Отбор.ТолькоНеСопоставленныеВПроекте=Ложь;
	Отбор.ПоказыватьВПроекте=-1;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВСмете(Команда)
	
	Отбор.ТолькоНеСопоставленныеВСмете=Ложь;
	Отбор.ПоказыватьВСмете=-1;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВПроекте(Команда)
	
	Если Элементы.ДеревоСмет.ТекущаяСтрока<>Неопределено Тогда
		Отбор.ПоказыватьВПроекте=Элементы.ДеревоСмет.ТекущиеДанные.НомерВПроекте;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСмете(Команда)
	
	Если Элементы.ЗадачиПроекта.ТекущаяСтрока<>Неопределено Тогда
		Отбор.ПоказыватьВСмете=Элементы.ЗадачиПроекта.ТекущиеДанные.НомерДляСопоставления;
	КонецЕсли;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьMSP(Команда)
	
	ЭлементыДерева = ЗадачиПроекта.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ЗадачиПроекта.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНС(Команда)
	
	ЭлементыДерева = ДеревоСмет.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоСмет.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьMSP(Команда)
	
	ЭлементыДерева = ЗадачиПроекта.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ЗадачиПроекта.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьНС(Команда)
	
	ЭлементыДерева = ДеревоСмет.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоСмет.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДобавлять(Команда)
	
	ТекСтр=Элементы.ЗадачиПроекта.ТекущиеДанные.НомерДляСопоставления;
	УстановитьДействиеНаСервере("Замещать","Добавлять");
	ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("НомерДляСопоставления",Элементы.ЗадачиПроекта.ТекущаяСтрока,ЗадачиПроекта.ПолучитьЭлементы(),ТекСтр,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗамещать(Команда)
	
	ТекСтр=Элементы.ЗадачиПроекта.ТекущиеДанные.НомерДляСопоставления;
	УстановитьДействиеНаСервере("Добавлять","Замещать");
	ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("НомерДляСопоставления",Элементы.ЗадачиПроекта.ТекущаяСтрока,ЗадачиПроекта.ПолучитьЭлементы(),ТекСтр,Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайлаПроекта(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ<>Неопределено Тогда
		Если Ответ.Действие="Продолжить" Тогда
			ПутьКФайлуПроекта=Ответ.Путь;
			
			Смета.ЗагрузитьЗначения(Ответ.Сметы);
			ФормаИндикатор=ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаИндикатор",Новый Структура("Текст","Загрузка данных проекта из MS Project"),ЭтаФорма,,ВариантОткрытияокна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			
			Если Объект.ОбработкаMSPНаКлиенте Тогда
				СтруктураПолей=Новый Структура();
				СтруктураПолей.Вставить("MSP_НаименованиеОбъекта","");
				СтруктураПолей.Вставить("MSP_ЕдиницаИзмеренияРесурса","");
				СтруктураПолей.Вставить("MSP_ВидОбъекта","");
				СтруктураПолей.Вставить("MSP_GUID","");
				СтруктураПолей.Вставить("MSP_Объем","");
				СтруктураПолей.Вставить("НомерДляСопоставления","");
				СтруктураПолей.Вставить("ЕстьВложенныеЗадачи","");
				СтруктураПолей.Вставить("НомерРодителя","");
				
				Для Каждого Стр Из  СоответствиеКолонокДопРеквизитов Цикл
					СтруктураПолей.Вставить(Стр.ИмяКолонки, Стр.Заголовок);
				КонецЦикла;	
				
				
				МассивЗначений=Новый Массив;	
				СМ_MSP_Клиент.ПрочитатьФайлОбъекта(ОбъектСтроительства,СтруктураПолей,МассивЗначений, Объект.СинхронизироватьПоДополнительнымРеквизитам,НаименованиеПроекта,ФормаИндикатор);
				
				
			КонецЕсли;
			ФоновоеЗадание = Ложь;
			Если ФормаИндикатор.Открыта() Тогда
			ФормаИндикатор.Элементы.Прогресс.МаксимальноеЗначение=100;
			ФормаИндикатор.Прогресс=5;
			ФормаИндикатор.Элементы.Текст.Заголовок="Сопоставление данных MS Project и сметы";
			ФормаИндикатор.ОбновитьОтображениеДанных();
			КонецЕсли;
			ЗаполнитьСерверВФоне(МассивЗначений,ФоновоеЗадание);
			Если ФоновоеЗадание Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
				ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", 1, Истина);
				ПараметрыОбработчика.МаксимальныйИнтервал = 5;
			Иначе
				ФормаИндикатор.Закрыть();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузка()
	Результат = ФоновоеЗаданиеПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаИндикатор.Открыта() Тогда 
			ЗаверешениеФоновогоЗадания();
			ФормаИндикатор.Закрыть(); 
		КонецЕсли;
		ЭтаФорма.ОбновитьОтображениеДанных();
	Иначе
		ФормаИндикатор.Прогресс=Результат.Прогресс;
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Функция ФоновоеЗаданиеПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.Вставить("Прогресс", 10);
	
	Ответ=ДлительныеОперации.ПрочитатьПрогресс(ФоновоеЗаданиеИдентификатор);
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда 
		Результат.Прогресс= Ответ.Процент;
	КонецЕсли;
	
	
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройки()  
	СтруктураПараметров = СМ_MSP_ВызовСервера.ПрочитатьНастройкиОбменаMSP();
	ЗаполнитьЗначенияСвойств(Объект, СтруктураПараметров);	
	Если СтруктураПараметров.Свойство("Настройки") Тогда
		Объект.Настройки = СтруктураПараметров.Настройки.Получить();
		Если ЗначениеЗаполнено(Объект.ПутьEXCEL) и Объект.ХранитьНастройкиВEXCEL Тогда
			// Читаем файл EXCEL - это и будут наши настройки.
			ТабДокумент = Новый ТабличныйДокумент();
			Попытка
				ТабДокумент.Прочитать(Объект.ПутьEXCEL,СпособЧтенияЗначенийТабличногоДокумента.Текст);
				Объект.Настройки = ТабДокумент;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;  
	
	Если   СтруктураПараметров.Свойство("ДополнительныеДанные") Тогда
		Допы = СтруктураПараметров.ДополнительныеДанные.Получить();
		Если Допы.Свойство("ОбработкаMSPНаКлиенте") Тогда
			Объект.ОбработкаMSPНаКлиенте=Допы.ОбработкаMSPНаКлиенте;
		КонецЕсли;	
		Если Допы.Свойство("РазрешенныеСтатусы") Тогда
			Объект.РазрешенныеСтатусы.Очистить();
			Объект.РазрешенныеСтатусы.Загрузить(Допы.РазрешенныеСтатусы);
		КонецЕсли;
		Если Допы.Свойство("ЗначенияФлажков") Тогда
			Для Каждого Эл Из Допы.ЗначенияФлажков Цикл
				Строки=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("ЮИД",Эл.ЮИД));
				Если  Строки.Количество()>0 Тогда
					Строки[0].Используется=Эл.Значение;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// папки с задачами
	ЭлементУсловногоОформления =УстановитьЭлементОформления("ЦветФона", Новый Цвет(229,229,229), "ЗадачиПроекта"); 
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.ЕстьВложенныеЗадачи");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	Если Отбор.ТолькоНеСопоставленныеВПроекте Тогда	
		ЭлементУсловногоОформления =УстановитьЭлементОформления("Видимость",Ложь, "ЗадачиПроекта");
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.ПоказыватьВНесопоставленных");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Ложь;
		ЭлементУсловия.Использование  = Истина;
	Иначе
		ЭлементУсловногоОформления =УстановитьЭлементОформления("ЦветФона", Новый Цвет(193, 251, 102), "ЗадачиПроекта");
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.Действие");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = "Замещать";
		ЭлементУсловия.Использование  = Истина;
		
		ЭлементУсловногоОформления =УстановитьЭлементОформления("ЦветФона", Новый Цвет(193, 255, 102), "ЗадачиПроекта");
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.Действие");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = "Добавлять";
		ЭлементУсловия.Использование  = Истина;
		
	КонецЕсли;
	
	Если Отбор.ТолькоНеСопоставленныеВСмете Тогда	
		ЭлементУсловногоОформления =УстановитьЭлементОформления("Видимость",Ложь, "ДеревоСмет");
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСмет.ПоказыватьВНесопоставленных");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Ложь;
		ЭлементУсловия.Использование  = Истина;
	КонецЕсли;	
	
	
	Если Отбор.ПоказыватьВСмете>0 Тогда
	ВТДерево = РеквизитФормыВЗначение("ДеревоСмет");
	СписокСсылок=Новый СписокЗначений;	

	Строки=ВтДерево.Строки.НайтиСтроки(Новый Структура("НомерВПроекте",Отбор.ПоказыватьВСмете),Истина);
	Для Каждого Эл Из Строки Цикл
			СписокСсылок.Добавить(Эл.НомерДляСопоставления);
    		РодительСтроки=Эл.Родитель;
			Пока РодительСтроки<>Неопределено Цикл
				СписокСсылок.Добавить(РодительСтроки.НомерДляСопоставления);
				РодительСтроки=РодительСтроки.Родитель;
			КонецЦикла;	
	КонецЦикла;
	
	ЭлементУсловногоОформления =УстановитьЭлементОформления("Видимость",Ложь, "ДеревоСмет");
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСмет.НомерДляСопоставления");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементУсловия.ПравоеЗначение = СписокСсылок;
	ЭлементУсловия.Использование  = Истина;
	КонецЕсли;
	
	Если Отбор.ПоказыватьВПроекте>0 Тогда
	ВТДерево = РеквизитФормыВЗначение("ЗадачиПроекта");
	СписокСсылок=Новый СписокЗначений;	
	СписокСсылок.Добавить(Отбор.ПоказыватьВПроекте);
	Строки=ВтДерево.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Отбор.ПоказыватьВПроекте),Истина);
	Для Каждого Эл Из Строки Цикл
    		РодительСтроки=Эл.Родитель;
			Пока РодительСтроки<>Неопределено Цикл
				СписокСсылок.Добавить(РодительСтроки.НомерДляСопоставления);
				РодительСтроки=РодительСтроки.Родитель;
			КонецЦикла;	
	КонецЦикла;
	
	ЭлементУсловногоОформления =УстановитьЭлементОформления("Видимость",Ложь, "ЗадачиПроекта");
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.НомерДляСопоставления");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементУсловия.ПравоеЗначение = СписокСсылок;
	ЭлементУсловия.Использование  = Истина;
	
	КонецЕсли;	

	ЭлементУсловногоОформления =УстановитьЭлементОформления("ЦветФона", Новый Цвет(251, 76, 27), "ДеревоСмет");
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСмет.ВСоответствии");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	ЭлементУсловия.Использование  = Истина;
	
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСмет.ЕстьВложенныеЗадачи");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	ЭлементУсловия.Использование  = Истина;
	
	
	
	ЭлементУсловногоОформления =УстановитьЭлементОформления("ТолькоПросмотр",Истина, "ЗадачиПроекта");
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.ОбъемСметы");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = 0;
	ЭлементУсловия.Использование  = Истина;
		
	
КонецПроцедуры

&НаСервере
Функция УстановитьЭлементОформления(НазваниеПараметра, ЗначениеПараметра, Таблица)
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(НазваниеПараметра, ЗначениеПараметра);
	Для Каждого Колонка ИЗ Элементы[Таблица].ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Колонка)=Тип("ГруппаФормы") Тогда
			Для Каждого КолонкаВл ИЗ Колонка.ПодчиненныеЭлементы Цикл
				ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(КолонкаВл.Имя);
			КонецЦикла;
		Иначе
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементУсловногоОформления;
КонецФункции

&НаСервере
Процедура ЗаполнитьСерверВФоне(МассивЗначений,ФоновоеЗадание)
	
	ВРДерево = РеквизитФормыВЗначение("ДеревоСмет"); 
	ТЗ = ДанныеФормыВЗначение(ЗадачиПроекта, Тип("ДеревоЗначений"));



	Данные=новый Структура;
	Данные.Вставить("ВРДерево",ВРДерево);
	Данные.Вставить("ТЗ",ТЗ);
	Данные.Вставить("ТЗСопоставлений",ДанныеФормыВЗначение(ТаблицаСопоставлений, Тип("ТаблицаЗначений")));
	Данные.Вставить("СоответствиеКолонокДопРеквизитов",ДанныеФормыВЗначение(СоответствиеКолонокДопРеквизитов, Тип("ТаблицаЗначений")));
	Данные.Вставить("МассивЗначений",МассивЗначений);
	Данные.Вставить("СинхронизироватьПоДополнительнымРеквизитам",Объект.СинхронизироватьПоДополнительнымРеквизитам);
	Данные.Вставить("ОбСтроительства",ОбъектСтроительства.Наименование);
	Данные.Вставить("Смета",Смета);
	Данные.Вставить("НаименованиеПроекта",НаименованиеПроекта);
	Данные.Вставить("Настройки",Объект.Настройки);

	
	//Адрес="";
	//Обработки.СМ_MSP_НастройкаСинхронизации.ЗаполнитьСерверВФоне(Данные,Адрес);	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.СМ_MSP_НастройкаСинхронизации.ЗаполнитьСерверВФоне",
	Данные, 
	НСтр("ru = 'Синхронизация с MSP'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		ЗаверешениеФоновогоЗадания();
	    
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ЗаверешениеФоновогоЗадания()
		Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ЗначениеВРеквизитФормы(Данные.ВРДерево, "ДеревоСмет");
		ЗначениеВДанныеФормы(Данные.ТЗ, ЗадачиПроекта);
		ЗначениеВДанныеФормы(Данные.ТЗСопоставлений, ТаблицаСопоставлений);
		
		УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВMSPНаСервере(ДвоичныеДанныеФайла,МассивЗначений,Позиции)
	
	ВТДеревоПроекта = РеквизитФормыВЗначение("ЗадачиПроекта");
	ВТДеревоСмет = РеквизитФормыВЗначение("ДеревоСмет");
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("GUID");
	ТЗ.Колонки.Добавить("Объем");
	ТЗ.Колонки.Добавить("Единица");
	ТЗ.Колонки.Добавить("Выгружено");		
	
	СтрокиПроекта=ВТДеревоПроекта.Строки.НайтиСтроки(Новый Структура("Действие","Замещать"),Истина);
	Для Каждого Эл Из  СтрокиПроекта Цикл
		Стр=ТЗ.Добавить();
		Стр.GUID=Эл.MSP_GUID;
		Стр.Объем=Эл.ОбъемДляВыгрузки;
		Стр.Единица=Эл.ЕдиницаСметы;
		
		Строки=ВТДеревоСмет.Строки.НайтиСтроки(Новый Структура("НомерВПроекте",Эл.НомерДляСопоставления),Истина);
		Для Каждого Пос Из Строки Цикл
			Позиции.Добавить(Пос.Ссылка);
		КонецЦикла;
		
	КонецЦикла;
	
	СтрокиПроекта=ВТДеревоПроекта.Строки.НайтиСтроки(Новый Структура("Действие","Добавлять"),Истина);
	Для Каждого Эл Из  СтрокиПроекта Цикл
		Стр=ТЗ.Добавить();
		Стр.GUID=Эл.MSP_GUID;
		Стр.Объем=Эл.ОбъемДляВыгрузки;
		Стр.Единица=Эл.ЕдиницаСметы;
		
		Строки=ВТДеревоСмет.Строки.НайтиСтроки(Новый Структура("НомерВПроекте",Эл.НомерДляСопоставления),Истина);
		Для Каждого Пос Из Строки Цикл
			Позиции.Добавить(Пос.Ссылка);
		КонецЦикла;

	КонецЦикла;
	
	Если Не Объект.ОбработкаMSPНаКлиенте Тогда
	Если СделатьРезервнуюКопиюПередВыгрузкой Тогда
		ДвоичныеДанныеФайла=Новый ДвоичныеДанные(Смета.Стройка.ПутьПроектMSP);
	КонецЕсли;
	Если СМ_MSP_ВызовСервера.ЗаписатьФайлОбъекта(Смета.Стройка,ТЗ) Тогда
		 ЗаписатьСтатусыПозицийНаСервере(Позиции);
	 КонецЕсли;
	 Возврат Истина;
 Иначе
	 МассивЗначений=ТабЗначВМассив(ТЗ);
	 Возврат Ложь;
 КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСтатусыПозицийНаСервере(Позиции)
		Для Каждого Пос Из Позиции Цикл
			Запись=РегистрыСведений.СМ_MSP_СтатусыВыгрузкиДокументов.СоздатьМенеджерЗаписи();
			Запись.Документ=Пос;
			Запись.Статус=Перечисления.СМ_MSP_СтатусыВыгрузкиДокументов.Выгружен;
			Запись.Записать();
		КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТабЗначВМассив(ТаблицаЗначений)
	
	НашМассив = Новый Массив;
    Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
        НашаСтруктура = Новый Структура;
        Счетчик = 0;
        Для Каждого СтрокаСтруктуры из СтрокаТаблицы Цикл
            Если НЕ ТипЗнч(СтрокаСтруктуры) = Тип(ТаблицаЗначений) тогда
                НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,СтрокаТаблицы[Счетчик]);
            Иначе
                НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,ТабЗначВМассив(СтрокаСтруктуры));
            КонецЕсли;
            Счетчик = Счетчик + 1;
        КонецЦикла;
        НашМассив.Добавить(НашаСтруктура);
    КонецЦикла;
    Возврат(НашМассив);
	
КонецФункции

&НаСервере
Процедура ИзменитьОбъемНаСервере(СтрокиПроекта)
	
	Для Каждого ТекПроект Из  СтрокиПроекта Цикл
		Проект=ЗадачиПроекта.НайтиПоИдентификатору(ТекПроект);
		РасчитатьОбъем(Проект);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьОбъем(Проект)
	
	Если Проект.Действие="Не изменять" Тогда
		Проект.ОбъемДляВыгрузки=Проект.MSP_Объем;
	ИначеЕсли Проект.Действие="Добавлять" Тогда
		Проект.ОбъемДляВыгрузки=Проект.MSP_Объем+Проект.ОбъемСметы;
	Иначе
		Проект.ОбъемДляВыгрузки=Проект.ОбъемСметы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеНаСервере(Действие,НовоеДействие)
	
	ТЗ = ДанныеФормыВЗначение(ЗадачиПроекта, Тип("ДеревоЗначений"));
	СтрокиПроекта=ТЗ.Строки.НайтиСтроки(Новый Структура("Действие",Действие),Истина);
	Для Каждого СтрокаПроекта Из СтрокиПроекта Цикл
		СтрокаПроекта.Действие=НовоеДействие;
		РасчитатьОбъем(СтрокаПроекта);
	КонецЦикла;
	ЗначениеВДанныеФормы(ТЗ, ЗадачиПроекта);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет(МассивЗначений=Неопределено)
	
	Результат=Новый Массив;
	
	ВТДеревоПроекта = РеквизитФормыВЗначение("ЗадачиПроекта");
	ВТДеревоСмет = РеквизитФормыВЗначение("ДеревоСмет");
	
	ТаблицаСметы = Новый ТаблицаЗначений;
	СоздатьТаблицу(ТаблицаСметы,ВТДеревоСмет);
	
	ТаблицаСметыНеСопоставленых=ТаблицаСметы.Скопировать();
	
	Строки=ВТДеревоСмет.Строки.НайтиСтроки(Новый Структура("ВидОбъекта","Позиция"),Истина);
	Для Каждого Эл Из Строки Цикл
		Если Эл.НомерВПроекте<=0 Тогда
			НоваяСтрока = ТаблицаСметыНеСопоставленых.Добавить();
		Иначе
			НоваяСтрока = ТаблицаСметы.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока ,Эл);
	КонецЦикла;	
	
	ТекстКолонкиСметы="";
	Для Каждого Колонка ИЗ ТаблицаСметы.Колонки Цикл
		Если Найти(Колонка.Имя,"Колонка")>0 Тогда
		ТекстКолонкиСметы=ТекстКолонкиСметы+", "+Колонка.Имя;
		КонецЕсли;
	КонецЦикла;	
	
	
	ТаблицаПроекта=Новый ТаблицаЗначений;
	
	СоздатьТаблицу(ТаблицаПроекта,ВТДеревоПроекта);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ТаблицаПроекта.Колонки.Добавить("Задача",Новый ОписаниеТипов(МассивТипов, , ));

	
	Строки=ВТДеревоПроекта.Строки.НайтиСтроки(Новый Структура("MSP_ВидОбъекта","Ресурс"),Истина);
	Для Каждого Эл Из Строки Цикл
		НоваяСтрока = ТаблицаПроекта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока ,Эл);
		Если Эл.Родитель<>Неопределено Тогда
			НоваяСтрока.Задача=Эл.Родитель.MSP_НаименованиеОбъекта;
		КонецЕсли;	
	КонецЦикла;
	
	
	ТекстКолонкиПроекта="";
	Для Каждого Колонка ИЗ ТаблицаПроекта.Колонки Цикл
		Если Найти(Колонка.Имя,"Колонка")>0 Тогда
		ТекстКолонкиПроекта=ТекстКолонкиПроекта+", "+Колонка.Имя;
		КонецЕсли;
	КонецЦикла;		
//	
//	
//	
//#Область НеСопоставленные

//	СхемаКомпоновкиДанных=РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОтчетНеСопоставленные");
//	НастройкиСКД  = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
//	
//	
//	
//	

//	//СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
//	//ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
//	//ИсточникДанных.Имя = "ИсточникДанных1";
//	//ИсточникДанных.ТипИсточникаДанных = "Local";
//	//
//	//НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
//	//НаборДанных.Имя = "НаборДанных1";
//	//НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
//	//НаборДанных.ИмяОбъекта = "ВТ";

//	//Для Каждого Эл Из ТаблицаСметыНеСопоставленых.Колонки Цикл
//	//	Если Эл.Имя="НомерДляСопоставления" или Эл.Имя="НомерВПроекте" Тогда   
//	//		Продолжить; 
//	//	Конецесли;
//	//	Поле1 = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//	//	Если  Найти(Эл.Имя,"Колонка")>0 Тогда
//	//		КолонкаТаблицы=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("ИмяКолонки",СтрЗаменить(Эл.Имя,"Д",""));
//	//		Если КолонкаТаблицы.Количество()>0 Тогда
//	//			Поле1.Заголовок=КолонкаТаблицы[0].Заголовок;
//	//		Иначе
//	//			Поле1.Заголовок = Эл.Заголовок;
//	//		Конецесли;
//	//		
//	//	Иначе
//	//		Поле1.Заголовок = Эл.Заголовок;
//	//	КонецЕсли;	
//	//	Поле1.ПутьКДанным = Эл.Имя;
//	//	Поле1.ТипЗначения = Эл.ТипЗначения;
//	//	Поле1.Поле = Эл.Имя;
//	//КонецЦикла;

//	//
//	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
//	//КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[0].Значение = "Зеленый"; 
//	//КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[0].Использование = Истина;

//	//
//	//СтруктураИерархии=КомпоновщикНастроек.Настройки.Структура;
//	//ИспользоватьНаименование=Истина;
//	//Для Каждого Эл Из ТаблицаСметыНеСопоставленых.Колонки Цикл
//	//	Если Лев(Эл.Имя,7)="ДКолонк" Тогда
//	//		ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//	//		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//		ПолеГруппировки.Использование = Истина;
//	//		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Эл.Имя);
//	//		АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//	//		АвтоПоле.Использование = Истина;
//	//		СтруктураИерархии=ГруппировкаСКД.Структура;
//	//	Конецесли;	
//	//КонецЦикла;	
//	//
//	//	ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Ссылка.ИДСметы");
//	//
//	//	
//	//	АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//	//	АвтоПоле.Использование = Истина;
//	//	
//	//	СтруктураИерархии=ГруппировкаСКД.Структура;
//	//		
//	//	ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Наименование");
//	//	

//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЕдиницаИзмеренияРесурса");


//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Шифр");
//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипНормативногоСборника");
//	//	
//	//	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
//	//	ПолеГруппировки.Использование = Истина;
//	//	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Объем");

//	//	ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//	//	ГруппировкаСКД .Использование = Истина;
//	//	ГруппировкаСКД.Имя = "Детальные";
//		
//		//НовоеПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Си);
//		//НовоеПоле.Использование = Истина;
//		
//		//АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//		//АвтоПоле.Использование = Истина;

//		//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
//		//НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();

//	
//   	ВнешниеНаборыДанных = Новый Структура;
//	ВнешниеНаборыДанных.Вставить("ВТ",ТаблицаСметыНеСопоставленых);
//	
//	
//	ТабДок=Новый ТабличныйДокумент;
//	

//	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных ,ДанныеРасшифровки);
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(ТабДок);
//	
//	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
//	Результат.Добавить(Новый Структура("ТД,Заголовок",ТабДок,"Не сопоставленные позиции сметы"));
//	Возврат Результат;

//#КонецОбласти

	
	
	
	
	
	
	
	
	
	СписокПолейСметы=" Ссылка, Наименование КАК НаименованиеПозиции,ЕдиницаИзмеренияРесурса КАК ЕдИзм,Объем КАК ОбъемПозиции,НомерВПроекте,Шифр,ТипНормативногоСборника,Статус"+ТекстКолонкиСметы;	
	СписокПолейПроекта=" Задача,MSP_НаименованиеОбъекта КАК Наименование, MSP_ЕдиницаИзмеренияРесурса КАК ЕдИзмПроект,MSP_Объем КАК ОбъемДо,НомерДляСопоставления, ОбъемДляВыгрузки КАК ОбъемПосле"+ТекстКолонкиПроекта; 
	
	запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ "+СписокПолейСметы+"  ПОМЕСТИТЬ Сметы ИЗ &ВТ КАК Вт; ВЫБРАТЬ "+СписокПолейПроекта+" ПОМЕСТИТЬ Проект ИЗ &ВТ2 КАК Вт;
	|ВЫБРАТЬ *,Сметы.Ссылка.ИДСметы КАК Смета ИЗ Проект ПОЛНОЕ СОЕДИНЕНИЕ Сметы ПО Проект.НомерДляСопоставления=Сметы.НомерВПроекте;";
	Запрос.УстановитьПараметр("ВТ",ТаблицаСметы);	
	Запрос.УстановитьПараметр("ВТ2",ТаблицаПроекта);
	Рез=Запрос.Выполнить().Выгрузить();
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.ИмяОбъекта = "ВТ";
	
	Для Каждого Эл Из Рез.Колонки Цикл
		Если Эл.Имя="НомерДляСопоставления" или Эл.Имя="НомерВПроекте" Тогда   
			Продолжить; 
		Конецесли;
		Поле1 = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Если  Найти(Эл.Имя,"Колонка")>0 Тогда
			КолонкаТаблицы=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("ИмяКолонки",Эл.Имя));
			Если КолонкаТаблицы.Количество()>0 Тогда
				Поле1.Заголовок=КолонкаТаблицы[0].Заголовок;
			Иначе
				Поле1.Заголовок = Эл.Заголовок;
			Конецесли;
			
		Иначе
			Поле1.Заголовок = Эл.Заголовок;
		КонецЕсли;	
		Поле1.ПутьКДанным = Эл.Имя;
		Поле1.ТипЗначения = Эл.ТипЗначения;
		Поле1.Поле = Эл.Имя;
	КонецЦикла;		
	
	
	ПолеРесурса = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеРесурса.Выражение = "Сумма(ОбъемПозиции)";
	ПолеРесурса.ПутьКДанным = "ОбъемПозиции";
	
	
	   КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[0].Значение = "Зеленый"; 
	КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[0].Использование = Истина;
	
	СтруктураИерархии=КомпоновщикНастроек.Настройки.Структура;
	ИспользоватьНаименование=Истина;
	Для Каждого Эл Из Рез.Колонки Цикл
		Если Лев(Эл.Имя,7)="Колонка" Тогда
			ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
			ПолеГруппировки.Использование = Истина;
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Эл.Имя);
			АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			АвтоПоле.Использование = Истина;
			СтруктураИерархии=ГруппировкаСКД.Структура;
			ИспользоватьНаименование=Ложь;
		Конецесли;	
	КонецЦикла;	
	
		ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Наименование");
		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Задача");
		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЕдИзмПроект");

		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ОбъемДо");

		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ОбъемПосле");
	
		
		АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		АвтоПоле.Использование = Истина;
		СтруктураИерархии=ГруппировкаСКД.Структура;
	
		ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("НаименованиеПозиции");
		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Смета");	
		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЕдИзм");


		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Шифр");
		
		ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));    
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ТипНормативногоСборника");
		
		АвтоПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		АвтоПоле.Использование = Истина;
		
	
	//ГруппировкаСКД = СтруктураИерархии.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//ГруппировкаСКД .Использование = Истина;
	//ГруппировкаСКД.Имя = "Детальные";


		НовоеПоле = ГруппировкаСКД .Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОбъемПозиции");
		НовоеПоле.Использование = Истина;


	//Для Каждого ПолеНабораДанных Из НаборДанных.Поля Цикл
	//	НовоеПоле = ГруппировкаСКД .Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеНабораДанных.Поле);
	//	НовоеПоле.Использование = Истина;
	//КонецЦикла;
		

	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();

	
	   ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ВТ",Рез);
	
	
	
	
	Результат=Новый ТабличныйДокумент;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных ,ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СоздатьТаблицу(ТЗ,Источник)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.СМ_ЛокальнаяСмета"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы"));
	МассивТипов.Добавить(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"));
	МассивТипов.Добавить(Тип("Строка"));
	
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , );
	
	Для Каждого Колонка Из Источник.Колонки Цикл
		ТЗ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстКомментария(Ид)
	СтрокаСметы=ДеревоСмет.НайтиПоИдентификатору(Ид);	
	Текст="";
	
	ТЗСопоставлений=ДанныеФормыВЗначение(ТаблицаСопоставлений, Тип("ТаблицаЗначений"));
	
	
	СтрокиСоответствия=ТЗСопоставлений.НайтиСтроки(Новый Структура("КодРаботы",СтрокаСметы.Шифр));
	
	Если СтрокиСоответствия.Количество()=0 Тогда
		
		Текст="Для кода позиции "+СтрокаСметы.Шифр+" не задано соответствие";
	Иначе
		ТипНСНеЗадан=Истина;
		Текст3="";
		ТИпНС=Строка(СтрокаСметы.ТипНормативногоСборника);
		Для Каждого Эл Из  СтрокиСоответствия Цикл
			Если  Эл.ТипНормативногоСборника=ТИпНС Тогда
				ТипНСНеЗадан=Ложь;
			Иначе
				Текст3=Текст3+Эл.ТипНормативногоСборника+Символы.ПС;
			Конецесли;	 
		КонецЦикла;
		Если ТипНСНеЗадан Тогда
			Текст=Текст+"Тип нормативного сборника: " +ТИпНС+Символы.ПС;
			Текст=Текст+"Есть соответствие шифра только для:"+ Текст3;	
			
		КонецЕсли;
		
		
		Если Объект.СинхронизироватьПоДополнительнымРеквизитам Тогда
			Для Каждого Кол Из СоответствиеКолонокДопРеквизитов Цикл
				если Кол.Используется Тогда
					РеквНеЗадан=Истина;
					Текст2="";
					Для Каждого Эл Из  СтрокиСоответствия Цикл
						Если  Эл["П"+Кол.ИмяКолонки]=СтрокаСметы["Д"+Кол.ИмяКолонки] Тогда
							РеквНеЗадан=Ложь;
						Иначе
							Текст2=Текст2+Эл["П"+Кол.ИмяКолонки];
							Текст2=Текст2+Символы.ПС;
						Конецесли;	 
					КонецЦикла;
					
					Если РеквНеЗадан Тогда
						Текст=Текст+"Значение "+Кол.Заголовок+": " +СтрокаСметы["Д"+Кол.ИмяКолонки]+Символы.ПС;
						Текст=Текст+"Есть соответствие шифра только для:"+ Текст2+Символы.ПС;	
						
					КонецЕсли;
					
				Конецесли;
			КонецЦикла;
		Конецесли;
	Конецесли;
	Возврат Текст;	
КонецФункции

#КонецОбласти
